/* automatically generated by rust-bindgen 0.71.1 */

pub use imgui_sys::{ImVec2, ImVec4, ImGuiCond, ImTextureID};
pub use imgui_sys::{ImGuiContext, ImDrawList};
pub use imgui_sys::{ImGuiMouseButton, ImGuiDragDropFlags};

pub type ImS8 = ::std::os::raw::c_schar;
pub type ImU8 = ::std::os::raw::c_uchar;
pub type ImS16 = ::std::os::raw::c_short;
pub type ImU16 = ::std::os::raw::c_ushort;
pub type ImS32 = ::std::os::raw::c_int;
pub type ImU32 = ::std::os::raw::c_uint;
pub type ImS64 = ::std::os::raw::c_longlong;
pub type ImU64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotContext {
    _unused: [u8; 0],
}
pub type ImPlotFlags = ::std::os::raw::c_int;
pub type ImPlotAxisFlags = ::std::os::raw::c_int;
pub type ImPlotCol = ::std::os::raw::c_int;
pub type ImPlotStyleVar = ::std::os::raw::c_int;
pub type ImPlotMarker = ::std::os::raw::c_int;
pub type ImPlotColormap = ::std::os::raw::c_int;
pub type ImPlotLocation = ::std::os::raw::c_int;
pub type ImPlotOrientation = ::std::os::raw::c_int;
pub type ImPlotYAxis = ::std::os::raw::c_int;
pub const ImPlotFlags__ImPlotFlags_None: ImPlotFlags_ = 0;
pub const ImPlotFlags__ImPlotFlags_NoTitle: ImPlotFlags_ = 1;
pub const ImPlotFlags__ImPlotFlags_NoLegend: ImPlotFlags_ = 2;
pub const ImPlotFlags__ImPlotFlags_NoMenus: ImPlotFlags_ = 4;
pub const ImPlotFlags__ImPlotFlags_NoBoxSelect: ImPlotFlags_ = 8;
pub const ImPlotFlags__ImPlotFlags_NoMousePos: ImPlotFlags_ = 16;

pub type ImPlotStyleVar_ = ::std::os::raw::c_uint;
pub const ImPlotMarker__ImPlotMarker_None: ImPlotMarker_ = -1;
pub const ImPlotMarker__ImPlotMarker_Circle: ImPlotMarker_ = 0;
pub const ImPlotMarker__ImPlotMarker_Square: ImPlotMarker_ = 1;
pub const ImPlotMarker__ImPlotMarker_Diamond: ImPlotMarker_ = 2;
pub const ImPlotMarker__ImPlotMarker_Up: ImPlotMarker_ = 3;
pub const ImPlotMarker__ImPlotMarker_Down: ImPlotMarker_ = 4;
pub const ImPlotMarker__ImPlotMarker_Left: ImPlotMarker_ = 5;
pub const ImPlotMarker__ImPlotMarker_Right: ImPlotMarker_ = 6;
pub const ImPlotMarker__ImPlotMarker_Cross: ImPlotMarker_ = 7;
pub const ImPlotMarker__ImPlotMarker_Plus: ImPlotMarker_ = 8;
pub const ImPlotMarker__ImPlotMarker_Asterisk: ImPlotMarker_ = 9;
pub const ImPlotMarker__ImPlotMarker_COUNT: ImPlotMarker_ = 10;
pub type ImPlotMarker_ = ::std::os::raw::c_int;
pub const ImPlotColormap__ImPlotColormap_Default: ImPlotColormap_ = 0;
pub const ImPlotColormap__ImPlotColormap_Deep: ImPlotColormap_ = 1;
pub const ImPlotColormap__ImPlotColormap_Dark: ImPlotColormap_ = 2;
pub const ImPlotColormap__ImPlotColormap_Pastel: ImPlotColormap_ = 3;
pub const ImPlotColormap__ImPlotColormap_Paired: ImPlotColormap_ = 4;
pub const ImPlotColormap__ImPlotColormap_Viridis: ImPlotColormap_ = 5;
pub const ImPlotColormap__ImPlotColormap_Plasma: ImPlotColormap_ = 6;
pub const ImPlotColormap__ImPlotColormap_Hot: ImPlotColormap_ = 7;
pub const ImPlotColormap__ImPlotColormap_Cool: ImPlotColormap_ = 8;
pub const ImPlotColormap__ImPlotColormap_Pink: ImPlotColormap_ = 9;
pub const ImPlotColormap__ImPlotColormap_Jet: ImPlotColormap_ = 10;
pub const ImPlotColormap__ImPlotColormap_COUNT: ImPlotColormap_ = 11;
pub type ImPlotColormap_ = ::std::os::raw::c_uint;
pub const ImPlotLocation__ImPlotLocation_Center: ImPlotLocation_ = 0;
pub const ImPlotLocation__ImPlotLocation_North: ImPlotLocation_ = 1;
pub const ImPlotLocation__ImPlotLocation_South: ImPlotLocation_ = 2;
pub const ImPlotLocation__ImPlotLocation_West: ImPlotLocation_ = 4;
pub const ImPlotLocation__ImPlotLocation_East: ImPlotLocation_ = 8;
pub const ImPlotLocation__ImPlotLocation_NorthWest: ImPlotLocation_ = 5;
pub const ImPlotLocation__ImPlotLocation_NorthEast: ImPlotLocation_ = 9;
pub const ImPlotLocation__ImPlotLocation_SouthWest: ImPlotLocation_ = 6;
pub const ImPlotLocation__ImPlotLocation_SouthEast: ImPlotLocation_ = 10;
pub type ImPlotLocation_ = ::std::os::raw::c_uint;
pub const ImPlotOrientation__ImPlotOrientation_Horizontal: ImPlotOrientation_ = 0;
pub const ImPlotOrientation__ImPlotOrientation_Vertical: ImPlotOrientation_ = 1;
pub type ImPlotOrientation_ = ::std::os::raw::c_uint;
pub const ImPlotYAxis__ImPlotYAxis_1: ImPlotYAxis_ = 0;
pub const ImPlotYAxis__ImPlotYAxis_2: ImPlotYAxis_ = 1;
pub const ImPlotYAxis__ImPlotYAxis_3: ImPlotYAxis_ = 2;
pub type ImPlotYAxis_ = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotPoint {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImPlotPoint"][::std::mem::size_of::<ImPlotPoint>() - 16usize];
    ["Alignment of ImPlotPoint"][::std::mem::align_of::<ImPlotPoint>() - 8usize];
    ["Offset of field: ImPlotPoint::x"][::std::mem::offset_of!(ImPlotPoint, x) - 0usize];
    ["Offset of field: ImPlotPoint::y"][::std::mem::offset_of!(ImPlotPoint, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotRange {
    pub Min: f64,
    pub Max: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImPlotRange"][::std::mem::size_of::<ImPlotRange>() - 16usize];
    ["Alignment of ImPlotRange"][::std::mem::align_of::<ImPlotRange>() - 8usize];
    ["Offset of field: ImPlotRange::Min"][::std::mem::offset_of!(ImPlotRange, Min) - 0usize];
    ["Offset of field: ImPlotRange::Max"][::std::mem::offset_of!(ImPlotRange, Max) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImPlotLimits {
    pub X: ImPlotRange,
    pub Y: ImPlotRange,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImPlotLimits"][::std::mem::size_of::<ImPlotLimits>() - 32usize];
    ["Alignment of ImPlotLimits"][::std::mem::align_of::<ImPlotLimits>() - 8usize];
    ["Offset of field: ImPlotLimits::X"][::std::mem::offset_of!(ImPlotLimits, X) - 0usize];
    ["Offset of field: ImPlotLimits::Y"][::std::mem::offset_of!(ImPlotLimits, Y) - 16usize];
};
#[repr(C)]
#[derive(Clone, Copy, Debug)]
pub struct ImPlotStyle {
    pub LineWeight: f32,
    pub Marker: ::std::os::raw::c_int,
    pub MarkerSize: f32,
    pub MarkerWeight: f32,
    pub FillAlpha: f32,
    pub ErrorBarSize: f32,
    pub ErrorBarWeight: f32,
    pub DigitalBitHeight: f32,
    pub DigitalBitGap: f32,
    pub PlotBorderSize: f32,
    pub MinorAlpha: f32,
    pub MajorTickLen: ImVec2,
    pub MinorTickLen: ImVec2,
    pub MajorTickSize: ImVec2,
    pub MinorTickSize: ImVec2,
    pub MajorGridSize: ImVec2,
    pub MinorGridSize: ImVec2,
    pub PlotPadding: ImVec2,
    pub LabelPadding: ImVec2,
    pub LegendPadding: ImVec2,
    pub LegendInnerPadding: ImVec2,
    pub LegendSpacing: ImVec2,
    pub MousePosPadding: ImVec2,
    pub AnnotationPadding: ImVec2,
    pub FitPadding: ImVec2,
    pub PlotDefaultSize: ImVec2,
    pub PlotMinSize: ImVec2,
    pub Colors: [ImVec4; 24usize],
    pub AntiAliasedLines: bool,
    pub UseLocalTime: bool,
    pub UseISO8601: bool,
    pub Use24HourClock: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImPlotStyle"][::std::mem::size_of::<ImPlotStyle>() - 560usize];
    ["Alignment of ImPlotStyle"][::std::mem::align_of::<ImPlotStyle>() - 4usize];
    ["Offset of field: ImPlotStyle::LineWeight"]
        [::std::mem::offset_of!(ImPlotStyle, LineWeight) - 0usize];
    ["Offset of field: ImPlotStyle::Marker"][::std::mem::offset_of!(ImPlotStyle, Marker) - 4usize];
    ["Offset of field: ImPlotStyle::MarkerSize"]
        [::std::mem::offset_of!(ImPlotStyle, MarkerSize) - 8usize];
    ["Offset of field: ImPlotStyle::MarkerWeight"]
        [::std::mem::offset_of!(ImPlotStyle, MarkerWeight) - 12usize];
    ["Offset of field: ImPlotStyle::FillAlpha"]
        [::std::mem::offset_of!(ImPlotStyle, FillAlpha) - 16usize];
    ["Offset of field: ImPlotStyle::ErrorBarSize"]
        [::std::mem::offset_of!(ImPlotStyle, ErrorBarSize) - 20usize];
    ["Offset of field: ImPlotStyle::ErrorBarWeight"]
        [::std::mem::offset_of!(ImPlotStyle, ErrorBarWeight) - 24usize];
    ["Offset of field: ImPlotStyle::DigitalBitHeight"]
        [::std::mem::offset_of!(ImPlotStyle, DigitalBitHeight) - 28usize];
    ["Offset of field: ImPlotStyle::DigitalBitGap"]
        [::std::mem::offset_of!(ImPlotStyle, DigitalBitGap) - 32usize];
    ["Offset of field: ImPlotStyle::PlotBorderSize"]
        [::std::mem::offset_of!(ImPlotStyle, PlotBorderSize) - 36usize];
    ["Offset of field: ImPlotStyle::MinorAlpha"]
        [::std::mem::offset_of!(ImPlotStyle, MinorAlpha) - 40usize];
    ["Offset of field: ImPlotStyle::MajorTickLen"]
        [::std::mem::offset_of!(ImPlotStyle, MajorTickLen) - 44usize];
    ["Offset of field: ImPlotStyle::MinorTickLen"]
        [::std::mem::offset_of!(ImPlotStyle, MinorTickLen) - 52usize];
    ["Offset of field: ImPlotStyle::MajorTickSize"]
        [::std::mem::offset_of!(ImPlotStyle, MajorTickSize) - 60usize];
    ["Offset of field: ImPlotStyle::MinorTickSize"]
        [::std::mem::offset_of!(ImPlotStyle, MinorTickSize) - 68usize];
    ["Offset of field: ImPlotStyle::MajorGridSize"]
        [::std::mem::offset_of!(ImPlotStyle, MajorGridSize) - 76usize];
    ["Offset of field: ImPlotStyle::MinorGridSize"]
        [::std::mem::offset_of!(ImPlotStyle, MinorGridSize) - 84usize];
    ["Offset of field: ImPlotStyle::PlotPadding"]
        [::std::mem::offset_of!(ImPlotStyle, PlotPadding) - 92usize];
    ["Offset of field: ImPlotStyle::LabelPadding"]
        [::std::mem::offset_of!(ImPlotStyle, LabelPadding) - 100usize];
    ["Offset of field: ImPlotStyle::LegendPadding"]
        [::std::mem::offset_of!(ImPlotStyle, LegendPadding) - 108usize];
    ["Offset of field: ImPlotStyle::LegendInnerPadding"]
        [::std::mem::offset_of!(ImPlotStyle, LegendInnerPadding) - 116usize];
    ["Offset of field: ImPlotStyle::LegendSpacing"]
        [::std::mem::offset_of!(ImPlotStyle, LegendSpacing) - 124usize];
    ["Offset of field: ImPlotStyle::MousePosPadding"]
        [::std::mem::offset_of!(ImPlotStyle, MousePosPadding) - 132usize];
    ["Offset of field: ImPlotStyle::AnnotationPadding"]
        [::std::mem::offset_of!(ImPlotStyle, AnnotationPadding) - 140usize];
    ["Offset of field: ImPlotStyle::FitPadding"]
        [::std::mem::offset_of!(ImPlotStyle, FitPadding) - 148usize];
    ["Offset of field: ImPlotStyle::PlotDefaultSize"]
        [::std::mem::offset_of!(ImPlotStyle, PlotDefaultSize) - 156usize];
    ["Offset of field: ImPlotStyle::PlotMinSize"]
        [::std::mem::offset_of!(ImPlotStyle, PlotMinSize) - 164usize];
    ["Offset of field: ImPlotStyle::Colors"]
        [::std::mem::offset_of!(ImPlotStyle, Colors) - 172usize];
    ["Offset of field: ImPlotStyle::AntiAliasedLines"]
        [::std::mem::offset_of!(ImPlotStyle, AntiAliasedLines) - 556usize];
    ["Offset of field: ImPlotStyle::UseLocalTime"]
        [::std::mem::offset_of!(ImPlotStyle, UseLocalTime) - 557usize];
    ["Offset of field: ImPlotStyle::UseISO8601"]
        [::std::mem::offset_of!(ImPlotStyle, UseISO8601) - 558usize];
    ["Offset of field: ImPlotStyle::Use24HourClock"]
        [::std::mem::offset_of!(ImPlotStyle, Use24HourClock) - 559usize];
};
#[repr(C)]
#[derive(Clone, Copy, Debug)]
pub struct ImPlotInputMap {
    pub PanButton: ImGuiMouseButton,
    pub PanMod: ::std::os::raw::c_int,
    pub FitButton: ImGuiMouseButton,
    pub ContextMenuButton: ImGuiMouseButton,
    pub BoxSelectButton: ImGuiMouseButton,
    pub BoxSelectMod: ::std::os::raw::c_int,
    pub BoxSelectCancelButton: ImGuiMouseButton,
    pub QueryButton: ImGuiMouseButton,
    pub QueryMod: ::std::os::raw::c_int,
    pub QueryToggleMod: ::std::os::raw::c_int,
    pub HorizontalMod: ::std::os::raw::c_int,
    pub VerticalMod: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ImPlotInputMap"][::std::mem::size_of::<ImPlotInputMap>() - 48usize];
    ["Alignment of ImPlotInputMap"][::std::mem::align_of::<ImPlotInputMap>() - 4usize];
    ["Offset of field: ImPlotInputMap::PanButton"]
        [::std::mem::offset_of!(ImPlotInputMap, PanButton) - 0usize];
    ["Offset of field: ImPlotInputMap::PanMod"]
        [::std::mem::offset_of!(ImPlotInputMap, PanMod) - 4usize];
    ["Offset of field: ImPlotInputMap::FitButton"]
        [::std::mem::offset_of!(ImPlotInputMap, FitButton) - 8usize];
    ["Offset of field: ImPlotInputMap::ContextMenuButton"]
        [::std::mem::offset_of!(ImPlotInputMap, ContextMenuButton) - 12usize];
    ["Offset of field: ImPlotInputMap::BoxSelectButton"]
        [::std::mem::offset_of!(ImPlotInputMap, BoxSelectButton) - 16usize];
    ["Offset of field: ImPlotInputMap::BoxSelectMod"]
        [::std::mem::offset_of!(ImPlotInputMap, BoxSelectMod) - 20usize];
    ["Offset of field: ImPlotInputMap::BoxSelectCancelButton"]
        [::std::mem::offset_of!(ImPlotInputMap, BoxSelectCancelButton) - 24usize];
    ["Offset of field: ImPlotInputMap::QueryButton"]
        [::std::mem::offset_of!(ImPlotInputMap, QueryButton) - 28usize];
    ["Offset of field: ImPlotInputMap::QueryMod"]
        [::std::mem::offset_of!(ImPlotInputMap, QueryMod) - 32usize];
    ["Offset of field: ImPlotInputMap::QueryToggleMod"]
        [::std::mem::offset_of!(ImPlotInputMap, QueryToggleMod) - 36usize];
    ["Offset of field: ImPlotInputMap::HorizontalMod"]
        [::std::mem::offset_of!(ImPlotInputMap, HorizontalMod) - 40usize];
    ["Offset of field: ImPlotInputMap::VerticalMod"]
        [::std::mem::offset_of!(ImPlotInputMap, VerticalMod) - 44usize];
};
unsafe extern "C" {
    pub fn ImPlotPoint_ImPlotPointNil() -> *mut ImPlotPoint;
}
unsafe extern "C" {
    pub fn ImPlotPoint_destroy(self_: *mut ImPlotPoint);
}
unsafe extern "C" {
    pub fn ImPlotPoint_ImPlotPointdouble(_x: f64, _y: f64) -> *mut ImPlotPoint;
}
unsafe extern "C" {
    pub fn ImPlotPoint_ImPlotPointVec2(p: ImVec2) -> *mut ImPlotPoint;
}
unsafe extern "C" {
    pub fn ImPlotRange_ImPlotRangeNil() -> *mut ImPlotRange;
}
unsafe extern "C" {
    pub fn ImPlotRange_destroy(self_: *mut ImPlotRange);
}
unsafe extern "C" {
    pub fn ImPlotRange_ImPlotRangedouble(_min: f64, _max: f64) -> *mut ImPlotRange;
}
unsafe extern "C" {
    pub fn ImPlotRange_Contains(self_: *mut ImPlotRange, value: f64) -> bool;
}
unsafe extern "C" {
    pub fn ImPlotRange_Size(self_: *mut ImPlotRange) -> f64;
}
unsafe extern "C" {
